In [1]:
import pandas as pd
import numpy as np
import json

#### users

In [2]:
behaviors = pd.read_csv('MINDsmall_train/behaviors.tsv', delimiter='\t', header=None, index_col=0)

In [3]:

behaviors.head()

,1,2,3,4
0,,,,
1,U13740,11/11/2019 9:05:58 AM,N55189 N42782 N34694 N45794 N18445 N63302 N104...,N55689-1 N35729-0
2,U91836,11/12/2019 6:11:30 PM,N31739 N6072 N63045 N23979 N35656 N43353 N8129...,N20678-0 N39317-0 N58114-0 N20495-0 N42977-0 N...
3,U73700,11/14/2019 7:01:48 AM,N10732 N25792 N7563 N21087 N41087 N5445 N60384...,N50014-0 N23877-0 N35389-0 N49712-0 N16844-0 N...
4,U34670,11/11/2019 5:28:05 AM,N45729 N2203 N871 N53880 N41375 N43142 N33013 ...,N35729-0 N33632-0 N49685-1 N27581-0
5,U8125,11/12/2019 4:11:21 PM,N10078 N56514 N14904 N33740,N39985-0 N36050-0 N16096-0 N8400-1 N22407-0 N6...

In [5]:
behaviors.isna().any()

1    False
2    False
3     True
4    False
dtype: bool

In [6]:
behaviors.iloc[1,3]

'N20678-0 N39317-0 N58114-0 N20495-0 N42977-0 N22407-0 N14592-0 N17059-1 N33677-0 N7821-0 N6890-0'

In [7]:
behaviors[behaviors.isna().any(axis=1)]

,1,2,3,4
0,,,,
29,U33207,11/11/2019 11:09:14 AM,NaN,N62212-0 N27521-0 N28983-0 N12028-0 N25437-0 N...
97,U89839,11/11/2019 4:57:51 AM,NaN,N12042-0 N35729-0 N49685-0 N62729-1
156,U5598,11/13/2019 2:01:40 PM,NaN,N7121-0 N37437-0 N53861-0 N45891-0 N21141-0 N5...
195,U19208,11/11/2019 3:57:34 PM,NaN,N23414-1 N52474-0 N6099-0 N5980-0 N1914-0
258,U6879,11/14/2019 5:33:52 PM,NaN,N9284-0 N23391-0 N42849-0 N33828-0 N57081-0 N2...
...,...,...,...,...
156851,U85936,11/10/2019 8:52:02 AM,NaN,N41140-1 N4148-0
156891,U4828,11/11/2019 9:41:21 AM,NaN,N8957-0 N60162-0 N16804-0 N24180-0 N31370-0 N2...
156898,U38290,11/14/2019 3:50:07 PM,NaN,N59267-0 N12446-0 N53031-0 N3380-0 N56211-0 N5...
156922,U64209,11/11/2019 7:11:07 AM,NaN,N35729-0 N15830-0 N48759-0 N21519-1 N27581-0 N...
156936,U35188,11/11/2019 1:39:46 PM,NaN,N13930-0 N55204-0 N38662-0 N53585-1 N55689-0

In [9]:
behaviors[behaviors.iloc[:,2:3].isna().any(axis=1)]

,1,2,3,4
0,,,,
29,U33207,11/11/2019 11:09:14 AM,NaN,N62212-0 N27521-0 N28983-0 N12028-0 N25437-0 N...
97,U89839,11/11/2019 4:57:51 AM,NaN,N12042-0 N35729-0 N49685-0 N62729-1
156,U5598,11/13/2019 2:01:40 PM,NaN,N7121-0 N37437-0 N53861-0 N45891-0 N21141-0 N5...
195,U19208,11/11/2019 3:57:34 PM,NaN,N23414-1 N52474-0 N6099-0 N5980-0 N1914-0
258,U6879,11/14/2019 5:33:52 PM,NaN,N9284-0 N23391-0 N42849-0 N33828-0 N57081-0 N2...
...,...,...,...,...
156851,U85936,11/10/2019 8:52:02 AM,NaN,N41140-1 N4148-0
156891,U4828,11/11/2019 9:41:21 AM,NaN,N8957-0 N60162-0 N16804-0 N24180-0 N31370-0 N2...
156898,U38290,11/14/2019 3:50:07 PM,NaN,N59267-0 N12446-0 N53031-0 N3380-0 N56211-0 N5...
156922,U64209,11/11/2019 7:11:07 AM,NaN,N35729-0 N15830-0 N48759-0 N21519-1 N27581-0 N...
156936,U35188,11/11/2019 1:39:46 PM,NaN,N13930-0 N55204-0 N38662-0 N53585-1 N55689-0

In [10]:
behaviors.iloc[:,2:3].isna().any()

3    True
dtype: bool

In [11]:
behaviors[behaviors.iloc[:,2:3].isna().any(axis=1)]

,1,2,3,4
0,,,,
29,U33207,11/11/2019 11:09:14 AM,NaN,N62212-0 N27521-0 N28983-0 N12028-0 N25437-0 N...
97,U89839,11/11/2019 4:57:51 AM,NaN,N12042-0 N35729-0 N49685-0 N62729-1
156,U5598,11/13/2019 2:01:40 PM,NaN,N7121-0 N37437-0 N53861-0 N45891-0 N21141-0 N5...
195,U19208,11/11/2019 3:57:34 PM,NaN,N23414-1 N52474-0 N6099-0 N5980-0 N1914-0
258,U6879,11/14/2019 5:33:52 PM,NaN,N9284-0 N23391-0 N42849-0 N33828-0 N57081-0 N2...
...,...,...,...,...
156851,U85936,11/10/2019 8:52:02 AM,NaN,N41140-1 N4148-0
156891,U4828,11/11/2019 9:41:21 AM,NaN,N8957-0 N60162-0 N16804-0 N24180-0 N31370-0 N2...
156898,U38290,11/14/2019 3:50:07 PM,NaN,N59267-0 N12446-0 N53031-0 N3380-0 N56211-0 N5...
156922,U64209,11/11/2019 7:11:07 AM,NaN,N35729-0 N15830-0 N48759-0 N21519-1 N27581-0 N...
156936,U35188,11/11/2019 1:39:46 PM,NaN,N13930-0 N55204-0 N38662-0 N53585-1 N55689-0

In [12]:
behaviors.shape

(156965, 4)

##### no user history

In [16]:
behaviors[behaviors.iloc[:,2:3].isna().any(axis=1)]

,1,2,3,4
0,,,,
29,U33207,11/11/2019 11:09:14 AM,NaN,N62212-0 N27521-0 N28983-0 N12028-0 N25437-0 N...
97,U89839,11/11/2019 4:57:51 AM,NaN,N12042-0 N35729-0 N49685-0 N62729-1
156,U5598,11/13/2019 2:01:40 PM,NaN,N7121-0 N37437-0 N53861-0 N45891-0 N21141-0 N5...
195,U19208,11/11/2019 3:57:34 PM,NaN,N23414-1 N52474-0 N6099-0 N5980-0 N1914-0
258,U6879,11/14/2019 5:33:52 PM,NaN,N9284-0 N23391-0 N42849-0 N33828-0 N57081-0 N2...
...,...,...,...,...
156851,U85936,11/10/2019 8:52:02 AM,NaN,N41140-1 N4148-0
156891,U4828,11/11/2019 9:41:21 AM,NaN,N8957-0 N60162-0 N16804-0 N24180-0 N31370-0 N2...
156898,U38290,11/14/2019 3:50:07 PM,NaN,N59267-0 N12446-0 N53031-0 N3380-0 N56211-0 N5...
156922,U64209,11/11/2019 7:11:07 AM,NaN,N35729-0 N15830-0 N48759-0 N21519-1 N27581-0 N...
156936,U35188,11/11/2019 1:39:46 PM,NaN,N13930-0 N55204-0 N38662-0 N53585-1 N55689-0

##### NAs have no history at all

In [18]:
na_index = set(behaviors.loc[behaviors.iloc[:,2:3].isna().any(axis=1),1]) 
valid_index = set(behaviors.loc[~behaviors.iloc[:,2:3].isna().any(axis=1),1]) 
na_index&valid_index

set()

In [19]:
behaviors[behaviors[1].isin(na_index)].iloc[:,2].unique()

array([nan], dtype=object)

In [20]:
behaviors.dropna().shape[0]-behaviors.shape[0]

-3238

In [21]:
behaviors.dropna(inplace=True)

##### add impression, history and ctr

In [22]:
def find_clicks(impression):
    impression = impression.split()
    imp = [int(i[-1]) for i in impression]
    return sum(imp)/len(imp)
def find_impress(impression):
    impression = impression.split()
    imp = [int(i[-1]) for i in impression]
    return len(imp)

In [23]:
behaviors['ctr'] = behaviors.iloc[:,3].apply(find_clicks)
behaviors['impress']=behaviors.iloc[:,3].apply(find_impress)
behaviors['history']=behaviors.iloc[:,2].apply(find_impress)

In [24]:
behaviors.iloc[1,3]

'N20678-0 N39317-0 N58114-0 N20495-0 N42977-0 N22407-0 N14592-0 N17059-1 N33677-0 N7821-0 N6890-0'

In [25]:
behaviors.head(10)

,1,2,3,4,ctr,impress,history
0,,,,,,,
1,U13740,11/11/2019 9:05:58 AM,N55189 N42782 N34694 N45794 N18445 N63302 N104...,N55689-1 N35729-0,0.500000,2,9
2,U91836,11/12/2019 6:11:30 PM,N31739 N6072 N63045 N23979 N35656 N43353 N8129...,N20678-0 N39317-0 N58114-0 N20495-0 N42977-0 N...,0.090909,11,82
3,U73700,11/14/2019 7:01:48 AM,N10732 N25792 N7563 N21087 N41087 N5445 N60384...,N50014-0 N23877-0 N35389-0 N49712-0 N16844-0 N...,0.027778,36,16
4,U34670,11/11/2019 5:28:05 AM,N45729 N2203 N871 N53880 N41375 N43142 N33013 ...,N35729-0 N33632-0 N49685-1 N27581-0,0.250000,4,10
5,U8125,11/12/2019 4:11:21 PM,N10078 N56514 N14904 N33740,N39985-0 N36050-0 N16096-0 N8400-1 N22407-0 N6...,0.014493,69,4
6,U19739,11/11/2019 6:52:13 PM,N39074 N14343 N32607 N32320 N22007 N442 N19001...,N21119-1 N53696-0 N33619-1 N25722-0 N2869-0,0.400000,5,36
7,U8355,11/11/2019 12:22:09 PM,N8419 N15771 N1431 N5888 N18663 N24123 N22130 ...,N51346-0 N33848-0 N15132-0 N10688-0 N6342-0 N6...,0.005780,173,35
8,U46596,11/12/2019 10:29:36 PM,N47438 N20950 N21317 N5469,N7821-0 N24898-0 N12029-0 N13579-0 N42977-0 N3...,0.142857,7,4
9,U79199,11/13/2019 10:13:02 AM,N37083 N459 N29499 N38118 N37378 N24691 N27235...,N51048-1 N64094-0 N13907-0 N39010-0,0.250000,4,19
10,U53231,11/11/2019 11:28:11 AM,N58936 N15919 N11917 N2153 N55312 N13008 N4142...,N53585-1 N55689-0,0.500000,2,28

In [26]:
behaviors.sort_values('ctr',ascending=False)

,1,2,3,4,ctr,impress,history
0,,,,,,,
23642,U46319,11/10/2019 2:05:44 AM,N1150 N19638 N43028 N53419 N57680 N41899 N1110...,N57097-0 N1034-1 N64916-1 N61022-1,0.750000,4,39
88189,U32574,11/12/2019 10:45:26 AM,N62325 N11703 N1954 N33669 N2203 N8845 N60172 ...,N42634-0 N58363-1 N40839-1 N63970-1,0.750000,4,36
24757,U85878,11/12/2019 6:50:44 AM,N46911 N50155 N29177 N47069 N64521 N38629 N558...,N49180-1 N62360-0 N33619-1 N41020-1,0.750000,4,185
4607,U69244,11/12/2019 4:27:40 PM,N31739 N61103 N51618 N21178 N14914 N8148,N42977-1 N19092-1 N6890-1 N17059-0,0.750000,4,6
41798,U19176,11/12/2019 8:48:55 AM,N4020 N13137 N45794 N46392 N61455 N5978 N60184...,N63970-1 N41020-0 N62360-1 N20069-1 N33619-1 N...,0.700000,10,26
...,...,...,...,...,...,...,...
29490,U13824,11/12/2019 4:01:55 PM,N64555 N1529 N59691 N21576 N22161 N31134 N3510...,N15855-0 N18708-0 N64851-0 N44422-0 N34998-0 N...,0.003448,290,21
51392,U74572,11/14/2019 12:06:30 PM,N11068 N51934 N18881 N24920 N10059 N56549 N121...,N58264-0 N48077-0 N8559-0 N54348-0 N46821-0 N6...,0.003425,292,32
7557,U71968,11/11/2019 3:53:51 AM,N20925 N56698 N13480 N10270 N55743 N45909 N434...,N61688-0 N4912-0 N17965-0 N52203-0 N29128-0 N2...,0.003401,294,11
39615,U59269,11/10/2019 5:30:15 AM,N64390 N18138 N58936 N51998 N42842 N38118 N475...,N3925-0 N48476-1 N37377-0 N8519-0 N17087-0 N13...,0.003390,295,18
136301,U10634,11/11/2019 2:35:05 PM,N31900 N36739 N34933 N32830 N46597 N37509,N28542-0 N28047-0 N32087-0 N15435-0 N17140-0 N...,0.003367,297,6

In [27]:
behaviors[['history','ctr','impress']].describe()

             history            ctr        impress
count  153727.000000  153727.000000  153727.000000
mean       33.225387       0.108548      37.228346
std        40.408679       0.129526      38.575186
min         1.000000       0.003367       2.000000
25%         8.000000       0.028571      10.000000
50%        20.000000       0.055556      24.000000
75%        43.000000       0.125000      51.000000
max       558.000000       0.750000     299.000000

In [31]:
[int(i[-1]) for i in behaviors.iloc[0,3].split()]

[1, 0]

In [32]:
len(behaviors.iloc[:,0].unique())

49108

In [33]:
behaviors.iloc[0,2]

'N55189 N42782 N34694 N45794 N18445 N63302 N10414 N19347 N31801'

In [34]:

pd.Timestamp(behaviors.iloc[0,1])

Timestamp('2019-11-11 09:05:58')

In [35]:
pd.to_datetime(behaviors.iloc[:,1]).iloc[0]

Timestamp('2019-11-11 09:05:58')

In [40]:
behaviors.iloc[:,0] == 'U13740'

0
1          True
2         False
3         False
4         False
5         False
          ...
156961    False
156962    False
156963    False
156964    False
156965    False
Name: 1, Length: 153727, dtype: bool

In [41]:
behaviors[behaviors.iloc[:,0] == 'U13740']

,1,2,3,4,ctr,impress,history
0,,,,,,,
1,U13740,11/11/2019 9:05:58 AM,N55189 N42782 N34694 N45794 N18445 N63302 N104...,N55689-1 N35729-0,0.500000,2,9
35263,U13740,11/9/2019 5:59:43 AM,N55189 N42782 N34694 N45794 N18445 N63302 N104...,N20020-0 N3737-0 N43202-0 N18708-0 N30125-0 N3...,0.003472,288,9
154837,U13740,11/13/2019 3:27:40 PM,N55189 N42782 N34694 N45794 N18445 N63302 N104...,N13907-0 N8509-0 N47061-0 N51048-0 N22417-0 N3...,0.038462,26,9

### news

In [115]:
news = pd.read_csv('MINDsmall_train/news.tsv', delimiter='\t', header=None, index_col=0)

In [43]:
news.head()

,1,2,3,4,5,6,7
0,,,,,,,
N55528,lifestyle,lifestyleroyals,"The Brands Queen Elizabeth, Prince Charles, an...","Shop the notebooks, jackets, and more that the...",https://assets.msn.com/labs/mind/AAGH0ET.html,"[{""Label"": ""Prince Philip, Duke of Edinburgh"",...",[]
N19639,health,weightloss,50 Worst Habits For Belly Fat,These seemingly harmless habits are holding yo...,https://assets.msn.com/labs/mind/AAB19MK.html,"[{""Label"": ""Adipose tissue"", ""Type"": ""C"", ""Wik...","[{""Label"": ""Adipose tissue"", ""Type"": ""C"", ""Wik..."
N61837,news,newsworld,The Cost of Trump's Aid Freeze in the Trenches...,Lt. Ivan Molchanets peeked over a parapet of s...,https://assets.msn.com/labs/mind/AAJgNsz.html,[],"[{""Label"": ""Ukraine"", ""Type"": ""G"", ""WikidataId..."
N53526,health,voices,I Was An NBA Wife. Here's How It Affected My M...,"I felt like I was a fraud, and being an NBA wi...",https://assets.msn.com/labs/mind/AACk2N6.html,[],"[{""Label"": ""National Basketball Association"", ..."
N38324,health,medical,"How to Get Rid of Skin Tags, According to a De...","They seem harmless, but there's a very good re...",https://assets.msn.com/labs/mind/AAAKEkt.html,"[{""Label"": ""Skin tag"", ""Type"": ""C"", ""WikidataI...","[{""Label"": ""Skin tag"", ""Type"": ""C"", ""WikidataI..."

In [44]:
news.shape

(51282, 7)

In [45]:
news.isna().any()

1    False
2    False
3    False
4     True
5    False
6     True
7     True
dtype: bool

In [46]:
news[news.isna().any(axis=1)]

,1,2,3,4,5,6,7
0,,,,,,,
N22028,lifestyle,lifestylebuzz,"Mom with schizophrenia, 6-year-old daughter mi...",NaN,https://assets.msn.com/labs/mind/AAJfTsZ.html,"[{""Label"": ""Queens"", ""Type"": ""G"", ""WikidataId""...",[]
N41835,news,newsworld,Today in History: November 2,NaN,https://assets.msn.com/labs/mind/AAJwpBS.html,[],[]
N25174,weather,weathertopstories,"Winter Storm Warning For Metro Denver, Boulder...",NaN,https://assets.msn.com/labs/mind/AAJwpSQ.html,"[{""Label"": ""Boulder, Colorado"", ""Type"": ""G"", ""...",[]
N45191,lifestyle,shop-all,Amazon Says These Are Its Funniest Customer Re...,NaN,https://assets.msn.com/labs/mind/AAEyYIZ.html,"[{""Label"": ""Amazon (company)"", ""Type"": ""O"", ""W...",[]
N31161,sports,baseball_mlb,Astros have a lot of baseball left despite two...,NaN,https://assets.msn.com/labs/mind/AAJgPPi.html,"[{""Label"": ""Houston Astros"", ""Type"": ""O"", ""Wik...",[]
...,...,...,...,...,...,...,...
N56193,sports,football_nfl,Cowboys have questionable red zone calls in lo...,NaN,https://assets.msn.com/labs/mind/BBWz2Xp.html,"[{""Label"": ""Dallas Cowboys"", ""Type"": ""O"", ""Wik...",[]
N10529,sports,football_nfl,Week 10 Game Balls: Few Bright Spots in Colts ...,NaN,https://assets.msn.com/labs/mind/BBWz39w.html,"[{""Label"": ""Bright spots on Ceres"", ""Type"": ""U...",[]
N55199,news,newsus,Winter homeless shelter remains unopened after...,NaN,https://assets.msn.com/labs/mind/BBWzAPK.html,[],[]
N47585,lifestyle,lifestylefamily,Family says 13-year-old Broadway star died fro...,NaN,https://assets.msn.com/labs/mind/BBWzQYV.html,"[{""Label"": ""Broadway theatre"", ""Type"": ""F"", ""W...",[]
N44276,autos,autossports,Best Sports Car Deals for October,NaN,https://assets.msn.com/labs/mind/BBy5rVe.html,"[{""Label"": ""Peugeot RCZ"", ""Type"": ""V"", ""Wikida...",[]

In [117]:
news.fillna('[]',inplace=True)

In [48]:
news.iloc[:,[1,2]].value_counts()

2                 3
newsworld         Photos of the Day                                                                             15
lifestylebuzz     Look of the Day                                                                               14
baseball_mlb      Video appears to show Astros stealing signs against Danny Farquhar                             6
                  Yu Darvish sends hilarious tweet about Astros cheating scandal                                 5
music-gallery     New and upcoming releases                                                                      5
                                                                                                                ..
newstrends        Three friends open sports bar on Ingersoll Avenue as a salute to Des Moines community          1
                  Three Sickened After Eating Tuna At Seattle Restaurant                                         1
                  Three Bars to Try This Weekend in Los Angeles                                                  1
                  This small-batch liqueur is made for Dia de los Muertos. Here's where to try it in Phoenix     1
ads-latingrammys  2019 Latin GRAMMY Awards: The Complete Winners List                                            1
Length: 50616, dtype: int64

In [49]:
news.iloc[:,1].value_counts()

newsus                    6564
football_nfl              5420
newspolitics              2826
newscrime                 2254
weathertopstories         2047
                          ...
newstvmedia                  1
cookingschool                1
finance-auto-insurance       1
foodtips                     1
tv-golden-globes-video       1
Name: 2, Length: 264, dtype: int64

#### subcatigory is too trivial

In [50]:
pd.DataFrame(news.iloc[:,1].value_counts()).describe()

                 2
count   264.000000
mean    194.250000
std     631.211339
min       1.000000
25%       2.000000
50%      15.500000
75%     110.250000
max    6564.000000

In [51]:
pd.DataFrame(news.iloc[:,2].value_counts()).describe()

                  3
count  50434.000000
mean       1.016814
std        0.182500
min        1.000000
25%        1.000000
50%        1.000000
75%        1.000000
max       15.000000

#### raw words data/embeddings

In [52]:
news.iloc[0,3]

"Shop the notebooks, jackets, and more that the royals can't live without."

In [53]:
len(news.iloc[0,2].split(' '))

11

In [54]:
news.iloc[1,3]

'These seemingly harmless habits are holding you back and keeping you from shedding that unwanted belly fat for good.'

In [55]:
news.iloc[2,3]

'Lt. Ivan Molchanets peeked over a parapet of sand bags at the front line of the war in Ukraine. Next to him was an empty helmet propped up to trick snipers, already perforated with multiple holes.'

In [56]:
news.iloc[2,2]

"The Cost of Trump's Aid Freeze in the Trenches of Ukraine's War"

In [57]:
news.iloc[2,5:]

6                                                   []
7    [{"Label": "Ukraine", "Type": "G", "WikidataId...
Name: N61837, dtype: object

In [58]:
news['title_len'] = news.iloc[:,2].apply(lambda x:len(x.split(' ')))

In [59]:
news['intro_len'] = news.iloc[:,3].apply(lambda x:len(x.split(' ')))

In [60]:
news.describe()

          title_len     intro_len
count  51282.000000  51282.000000
mean      10.769919     34.488417
std        3.286625     26.636350
min        1.000000      1.000000
25%        9.000000     15.000000
50%       10.000000     24.000000
75%       13.000000     63.000000
max       56.000000    478.000000

### giviing title len is 13 for 75 percentile, maybe it's okay to just limit it to 10 or 13

##### cleaning and preprocessing

In [29]:
import string
string.punctuation

'!"#$%&\'()*+,-./:;<=>?@[\\]^_`{|}~'

In [61]:
news.iloc[2,2].split(' ')

['The',
 'Cost',
 'of',
 "Trump's",
 'Aid',
 'Freeze',
 'in',
 'the',
 'Trenches',
 'of',
 "Ukraine's",
 'War']

#### contextual data

In [62]:
json.loads(news.iloc[0,5])

[{'Label': 'Prince Philip, Duke of Edinburgh',
  'Type': 'P',
  'WikidataId': 'Q80976',
  'Confidence': 1.0,
  'OccurrenceOffsets': [48],
  'SurfaceForms': ['Prince Philip']},
 {'Label': 'Charles, Prince of Wales',
  'Type': 'P',
  'WikidataId': 'Q43274',
  'Confidence': 1.0,
  'OccurrenceOffsets': [28],
  'SurfaceForms': ['Prince Charles']},
 {'Label': 'Elizabeth II',
  'Type': 'P',
  'WikidataId': 'Q9682',
  'Confidence': 0.97,
  'OccurrenceOffsets': [11],
  'SurfaceForms': ['Queen Elizabeth']}]

In [63]:
json.loads(news.iloc[1,6])

[{'Label': 'Adipose tissue',
  'Type': 'C',
  'WikidataId': 'Q193583',
  'Confidence': 1.0,
  'OccurrenceOffsets': [97],
  'SurfaceForms': ['belly fat']}]

In [64]:
json.loads(news.iloc[1,6])

[{'Label': 'Adipose tissue',
  'Type': 'C',
  'WikidataId': 'Q193583',
  'Confidence': 1.0,
  'OccurrenceOffsets': [97],
  'SurfaceForms': ['belly fat']}]

In [65]:
pd.DataFrame(json.loads(news.iloc[1,6]))#.apply(lambda x:len(x))

            Label Type WikidataId  Confidence OccurrenceOffsets SurfaceForms
0  Adipose tissue    C    Q193583         1.0              [97]  [belly fat]

##### clean column abstract column

In [66]:
news.iloc[:,5:].fillna('[]',inplace=True)

##### title and abstract has about 13000 missing value each

In [69]:
news.head()

,1,2,3,4,5,6,7,title_len,intro_len
0,,,,,,,,,
N55528,lifestyle,lifestyleroyals,"The Brands Queen Elizabeth, Prince Charles, an...","Shop the notebooks, jackets, and more that the...",https://assets.msn.com/labs/mind/AAGH0ET.html,"[{""Label"": ""Prince Philip, Duke of Edinburgh"",...",[],11,12
N19639,health,weightloss,50 Worst Habits For Belly Fat,These seemingly harmless habits are holding yo...,https://assets.msn.com/labs/mind/AAB19MK.html,"[{""Label"": ""Adipose tissue"", ""Type"": ""C"", ""Wik...","[{""Label"": ""Adipose tissue"", ""Type"": ""C"", ""Wik...",6,19
N61837,news,newsworld,The Cost of Trump's Aid Freeze in the Trenches...,Lt. Ivan Molchanets peeked over a parapet of s...,https://assets.msn.com/labs/mind/AAJgNsz.html,[],"[{""Label"": ""Ukraine"", ""Type"": ""G"", ""WikidataId...",12,36
N53526,health,voices,I Was An NBA Wife. Here's How It Affected My M...,"I felt like I was a fraud, and being an NBA wi...",https://assets.msn.com/labs/mind/AACk2N6.html,[],"[{""Label"": ""National Basketball Association"", ...",12,21
N38324,health,medical,"How to Get Rid of Skin Tags, According to a De...","They seem harmless, but there's a very good re...",https://assets.msn.com/labs/mind/AAAKEkt.html,"[{""Label"": ""Skin tag"", ""Type"": ""C"", ""WikidataI...","[{""Label"": ""Skin tag"", ""Type"": ""C"", ""WikidataI...",11,31

In [ ]:
new

In [113]:
news.iloc[2173:2175,5]#.apply(lambda x:len(json.loads(x))==0)#].shape#.value_counts()

0
N49553
N43595    []
Name: 6, dtype: object

In [118]:
news.iloc[2173:2175,5]#.apply(lambda x:len(json.loads(x))==0)#].shape#.value_counts()

0
N49553    []
N43595    []
Name: 6, dtype: object

In [119]:
news[news.iloc[:,6].apply(lambda x:len(json.loads(x))==0)].shape#.value_counts()

(13829, 7)

In [120]:
news[news.iloc[:,[0,1,2,4,5,6]].isna().any(axis=1)]

Empty DataFrame
Columns: [1, 2, 3, 4, 5, 6, 7]
Index: []

In [121]:
news.iloc[:10,6].apply(lambda x:json.loads(x))

0
N55528                                                   []
N19639    [{'Label': 'Adipose tissue', 'Type': 'C', 'Wik...
N61837    [{'Label': 'Ukraine', 'Type': 'G', 'WikidataId...
N53526    [{'Label': 'National Basketball Association', ...
N38324    [{'Label': 'Skin tag', 'Type': 'C', 'WikidataI...
N2073     [{'Label': 'National Football League', 'Type':...
N49186    [{'Label': 'Orlando, Florida', 'Type': 'G', 'W...
N59295    [{'Label': 'Santiago', 'Type': 'G', 'WikidataI...
N24510                                                   []
N39237    [{'Label': 'WXII-TV', 'Type': 'M', 'WikidataId...
Name: 7, dtype: object

In [122]:
news.iloc[0,4]

'https://assets.msn.com/labs/mind/AAGH0ET.html'

In [123]:
len(news.index.unique())

51282

### entity embedding

In [125]:
with open("MINDsmall_train/entity_embedding.vec", "r") as ins:
    entity_embed = []
    for line in ins:
        entity_embed.append(line)

In [126]:
entity_embed = pd.read_csv('MINDsmall_train/entity_embedding.vec', delimiter='\t', header=None, index_col=0)

In [127]:
entity_embed.head()

,1,2,3,4,5,6,7,8,9,10,...,92,93,94,95,96,97,98,99,100,101
0,,,,,,,,,,,,,,,,,,,,,
Q41,-0.063388,-0.181451,0.057501,-0.091254,-0.076217,-0.052525,0.050500,-0.224871,-0.018145,0.030722,...,0.001861,0.124535,-0.151043,-0.263698,-0.103607,0.020007,-0.101157,-0.091567,0.035234,NaN
Q1860,0.060958,0.069934,0.015832,0.079471,-0.023362,-0.125007,-0.043618,0.134063,-0.121691,0.089166,...,-0.014287,0.013578,0.099977,0.012199,-0.141138,0.056129,-0.133727,0.025795,0.051448,NaN
Q39631,-0.093106,-0.052002,0.020556,-0.020801,0.043180,-0.072321,0.000910,0.028156,0.176303,0.035396,...,-0.086840,-0.078992,-0.062712,0.051117,-0.184307,0.127637,-0.144866,0.044690,0.013498,NaN
Q30,-0.115737,-0.179113,0.102739,-0.112469,-0.101853,-0.177516,0.015860,-0.092626,0.086708,0.057850,...,0.080511,-0.000085,-0.089968,-0.083486,-0.149992,-0.053031,-0.136071,-0.029001,0.174155,NaN
Q60,-0.051036,-0.165637,0.132802,-0.089949,-0.146637,-0.142246,0.103853,-0.129651,0.096265,0.017288,...,0.078628,0.003711,-0.058953,-0.154067,-0.117159,-0.031614,-0.140451,0.001288,0.140350,NaN

In [128]:

len(entity_embed.iloc[:,0].unique())

24390

In [129]:
sum(entity_embed.iloc[:,100].isna())

26904

In [130]:
entity_embed.drop(101,inplace=True,axis=1)

In [131]:
entity_embed.shape

(26904, 100)

In [132]:
relations = pd.read_csv('MINDsmall_train/relation_embedding.vec', delimiter='\t', header=None, index_col=0)

In [133]:
relations.shape

(1091, 101)

In [134]:
relations.columns[relations.isna().any()]

Int64Index([101], dtype='int64')

In [135]:
relations.head()

,1,2,3,4,5,6,7,8,9,10,...,92,93,94,95,96,97,98,99,100,101
0,,,,,,,,,,,,,,,,,,,,,
P31,-0.073467,-0.132227,0.034173,-0.032769,0.008289,-0.107088,-0.031712,-0.039581,0.101882,-0.106961,...,-0.050068,-0.053686,-0.045389,-0.037017,0.117190,-0.063597,-0.056910,0.058387,-0.114056,NaN
P21,-0.078436,0.108589,-0.049429,-0.131355,0.049300,-0.094605,-0.101469,0.127802,-0.081245,0.113759,...,0.074341,-0.030571,-0.137183,0.045598,-0.151155,-0.066223,0.057489,0.130188,-0.054801,NaN
P106,-0.052137,0.052444,-0.019886,-0.152309,0.014144,-0.180491,-0.132198,0.063082,0.085229,0.114965,...,-0.058958,-0.032021,-0.147213,0.082776,-0.169705,0.122445,-0.054737,0.055321,0.070961,NaN
P735,-0.051398,0.056219,0.068029,-0.137717,-0.030050,0.061566,-0.103184,-0.074124,-0.118975,0.122100,...,-0.092234,0.056870,0.013640,0.042696,0.013683,-0.021127,-0.189257,0.055315,0.101863,NaN
P108,0.091231,0.022526,0.059349,-0.141853,0.035025,-0.111040,-0.127337,0.047645,-0.172328,0.090933,...,-0.046994,-0.056248,-0.146538,0.121375,-0.211757,0.077591,-0.002200,-0.053880,0.140873,NaN

In [136]:
len(relations.index.unique())

1091

#### get embeddings

In [140]:
doc_feature = pd.read_csv('data\doc_feature.txt', sep=' ', header=None)

In [141]:
doc_feature.head()

        0                              1                    2
0  N55528            1,2,3,4,5,6,7,5,8,9  0,0,3,3,2,2,0,2,1,0
1  N19639      10,11,12,13,14,15,0,0,0,0  0,0,0,0,4,4,0,0,0,0
2  N61837    1,16,17,18,19,20,21,22,1,23  0,0,0,0,0,0,0,0,0,0
3  N53526  24,25,26,27,28,29,19,30,31,32  0,0,0,0,0,0,0,0,0,0
4  N38324  30,33,34,35,17,36,37,38,33,39  0,0,0,0,0,5,5,0,0,0

In [146]:
news.iloc[0,2]

'The Brands Queen Elizabeth, Prince Charles, and Prince Philip Swear By'

In [147]:
news.iloc[1,2]

'50 Worst Habits For Belly Fat'

In [148]:
news.iloc[2,2]

"The Cost of Trump's Aid Freeze in the Trenches of Ukraine's War"

In [150]:
news.iloc[3,2]

"I Was An NBA Wife. Here's How It Affected My Mental Health."

In [149]:
news.iloc[4,2]

'How to Get Rid of Skin Tags, According to a Dermatologist'